Architecture diagram fix
